5_admin_apps/third/app/controllers/users_controller.rb

  def find_user
    @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]